import networkx as nx
import matplotlib.pyplot as plt

# Словник графа для транспортної мережі логістичної фірми, яка працює в заданих регіонах
graph = {
    "Київ": [("Умань", 200), ("Житомир", 140), ("Полтава", 350), ("Чернігів", 150), ("Кропивницький", 300)],
    "Умань": [("Київ", 200), ("Первомайськ", 100), ("Одеса", 300), ("Вінниця", 160), ("Кропивницький", 160)],
    "Первомайськ": [("Умань", 100), ("Вознесенськ", 70), ("Кропивницький", 130)],
    "Миколаїв": [("Вознесенськ", 100), ("Одеса", 140), ("Херсон", 70), ("Кропивницький", 120)],
    "Вінниця": [("Умань", 160), ("Житомир", 120)],
    "Одеса": [("Вознесенськ", 120), ("Миколаїв", 140), ("Ізмаїл", 250)],
    "Черкаси": [("Київ", 170), ("Полтава", 220)],
    "Кропивницький": [("Київ", 300), ("Черкаси", 130), ("Умань", 160)],
    "Житомир": [("Київ", 140), ("Вінниця", 120)],
    "Полтава": [("Київ", 350), ("Черкаси", 220)],
    "Чернігів": [("Київ", 350)],
    "Вознесенськ": [("Первомайськ", 70), ("Миколаїв", 140), ("Одеса", 120)],
    "Ізмаїл": [("Одеса", 250)],
    "Херсон": [("Миколаїв", 70)],
}

# Координати міст (широта, довгота)
coordinates = {
    "Київ": (50.45, 30.52),
    "Умань": (48.75, 30.22),
    "Житомир": (50.25, 28.67),
    "Полтава": (49.59, 34.54),
    "Чернігів": (51.49, 31.30),
    "Первомайськ": (48.04, 30.85),
    "Вознесенськ": (47.56, 31.33),
    "Одеса": (46.48, 30.73),
    "Вінниця": (49.23, 28.48),
    "Херсон": (46.63, 32.62),
    "Ізмаїл": (45.35, 28.84),
    "Черкаси": (49.43, 32.06),
    "Кропивницький": (48.50, 32.27),
    "Миколаїв": (46.97, 31.99)
}

# Створюємо об'єкт графа
G = nx.Graph()

# Додаємо вершини та ребра до графа з вагою
for node, neighbors in graph.items():
    for neighbor, weight in neighbors:
        G.add_edge(node, neighbor, weight=weight)

# Створимо новий словник без ваг для BFS
graph_no_weights = {node: [neighbor for neighbor, weight in neighbors] for node, neighbors in graph.items()}


# Запускатиметься лише при прямому виконанні
if __name__ == "__main__":
    # Інформація про граф
    print(f"Кількість вузлів: {G.number_of_nodes()}")
    print(f"Кількість ребер: {G.number_of_edges()}")
    print(f"Вузли графа: {list(G.nodes)}")
    print(f"Ребра графа: {list(G.edges(data=True))}")
    print(f"Сусіди Києва: {list(G.adj['Київ'])}")
    print(f"Сусіди Умані: {list(G.adj['Умань'])}")
    print(f"Ступінь вершини Київ: {G.degree['Київ']}")
    print(f"Ступінь вершини Умань: {G.degree['Умань']}")

    # Візуалізація графа з використанням географічних координат
    pos = {node: (long, lat) for node, (lat, long) in coordinates.items()}
    nx.draw(G, pos, with_labels=True, node_color='skyblue', node_size=2000, font_size=10, font_color='black')
    labels = nx.get_edge_attributes(G, 'weight')
    nx.draw_networkx_edge_labels(G, pos, edge_labels=labels)
    plt.title('Realistic Visualization of Transport Network for Logistics Company')
    plt.show()
